cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"

# GNU tools
brew "autoconf"
brew "automake"
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "wget"

# Standard tools
brew "curl"
brew "git"
brew "nano"
brew "libtool"
brew "moreutils"
brew "openssh"

# Terminal
brew "tmate"
brew "tmux"
brew "zsh"

# Version management tools
brew "rbenv"
brew "ruby-build"

# Others
brew "hashicorp/tap/terraform"
brew "httpstat"
brew "jq"